notable_back/app/controllers/patients_controller.rb

  def create
    patient = Patient.new(patient_params)
    if patient.save
---
INSERT INTO "patients" ("name", "dob", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Max"], ["dob", "1991-06-22"], ["email", "mzakzook@me.com"], ["created_at", "2020-06-13 20:45:39.187623"], ["updated_at", "2020-06-13 20:45:39.187623"]]

  def index
    patients = Patient.all
---
SELECT "patients".* FROM "patients"

  def show
    patient = Patient.find(params[:id])
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    patient = Patient.find(params[:id])
    patient.update(patient_params)
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "patients" SET "email" = $1, "updated_at" = $2 WHERE "patients"."id" = $3  [["email", "uno@bruno.com"], ["updated_at", "2020-06-14 21:55:40.705044"], ["id", 16]]

  def destroy
    patient = Patient.find(params[:id])
    patient.destroy
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "patients" WHERE "patients"."id" = $1  [["id", 13]]